{
  "1": {
    "roll": "1",
    "result": "A large group of children are watching a puppet show. The puppet show is acting out the player's last adventure perfectly."
  },
  "2": {
    "roll": "2",
    "result": "An up-and-coming artist asks to paint a portrait of the party."
  },
  "3": {
    "roll": "3",
    "result": "A group of barbarians from the far north are arguing with a local merchant."
  },
  "4": {
    "roll": "4",
    "result": "A wooden wagon has lost a wheel, causing barrels of fruit to roll into the street."
  },
  "5": {
    "roll": "5",
    "result": "A diseased vagabond asks the players for coins."
  },
  "6": {
    "roll": "6",
    "result": "A group of laborers begin unloading a cargo wagon nearby."
  },
  "7": {
    "roll": "7",
    "result": "A fortune teller sits in a tent, waiting for her next customer."
  },
  "8": {
    "roll": "8",
    "result": "A group of guards are taking a break and playing cards."
  },
  "9": {
    "roll": "9",
    "result": "A mysterious figure in a black cloak is trailing the players."
  },
  "10": {
    "roll": "10",
    "result": "A nearby bakery sets fresh pies on the windowsill."
  },
  "11": {
    "roll": "11",
    "result": "A beautiful noble woman is admiring the settlement, with a group of armed guards close by."
  },
  "12": {
    "roll": "12",
    "result": "A panicked mother is screaming for her child."
  },
  "13": {
    "roll": "13",
    "result": "A frail looking stray cat begins following the players."
  },
  "14": {
    "roll": "14",
    "result": "An angry store owner is fixing a broken shop window."
  },
  "15": {
    "roll": "15",
    "result": "Several acrobats occupy a part of the street and display great skill in their movements and contortions."
  },
  "16": {
    "roll": "16",
    "result": "A red-faced sage is mumbling on the ground, looking for a lost amulet."
  },
  "17": {
    "roll": "17",
    "result": "A pompous-looking wizard drops his spellbook in the middle of a busy street corner."
  },
  "18": {
    "roll": "18",
    "result": "A mysterious woman from a far-away land is watching the crowds with a keen eye."
  },
  "19": {
    "roll": "19",
    "result": "A large wild animal walks calmly down the street. People run away and shout."
  },
  "20": {
    "roll": "20",
    "result": "A pickpocket attempts to steal an item of value from a random player."
  },
  "21": {
    "roll": "21",
    "result": "An older gentleman is telling at his young apprentice for making a mistake."
  },
  "22": {
    "roll": "22",
    "result": "A group of miners are protesting outside a noble's estate over poor work conditions."
  },
  "23": {
    "roll": "23",
    "result": "Three old men sitting in rocking chairs shoot glares at the players."
  },
  "24": {
    "roll": "24",
    "result": "A street performer is playing a lute, hopeful to make some coin."
  },
  "25": {
    "roll": "25",
    "result": "A group of guards are trying to apprehend a thief, who is scaling a nearby building."
  },
  "26": {
    "roll": "26",
    "result": "A strange, cloaked figure asks where the local library is."
  },
  "27": {
    "roll": "27",
    "result": "A group of guards are clustered around the entrance to an alleyway. They look concerned and serious."
  },
  "28": {
    "roll": "28",
    "result": "A group of friendly drunken halflings ask the players to join in their celebration."
  },
  "29": {
    "roll": "29",
    "result": "A beloved explorer is delivering a crate of ancient relics to a local museum."
  },
  "30": {
    "roll": "30",
    "result": "An attractive maiden begins flirting with a player. Her muscular husband takes notice."
  },
  "31": {
    "roll": "31",
    "result": "A shopping list of rare herbs falls into the hands of a random player."
  },
  "32": {
    "roll": "32",
    "result": "A group of thugs try to trick the players into coming down a nearby alley."
  },
  "33": {
    "roll": "33",
    "result": "A mercenary with a large wooden club asks the players for work."
  },
  "34": {
    "roll": "34",
    "result": "A local madman spouts gibberish about a prophecy. Everyone ignores him."
  },
  "35": {
    "roll": "35",
    "result": "A messanger of the Settlement Ruler accidently drops his backpack in front of the party."
  },
  "36": {
    "roll": "36",
    "result": "An abused servant asks the party to help them get revenge."
  },
  "37": {
    "roll": "37",
    "result": "A merchant asks the players to guard his shop for the night from thieves in exchange for some coin."
  },
  "38": {
    "roll": "38",
    "result": "A group of sleepy looking dwarves walk through the streets, carrying a large telescope."
  },
  "39": {
    "roll": "39",
    "result": "A local tinkerer is showing off the metal construct he built in his basement."
  },
  "40": {
    "roll": "40",
    "result": "A noble invites the players to a house party."
  },
  "41": {
    "roll": "41",
    "result": "A street fight breaks out around the party as rival gangs begin to battle."
  },
  "42": {
    "roll": "42",
    "result": "A robed mystic carries a large bundle of strong-smelling incense."
  },
  "43": {
    "roll": "43",
    "result": "A shady merchant attempts to sell the players illegal drugs."
  },
  "44": {
    "roll": "44",
    "result": "A crowd gathers around the corpse of an evil wizard hanging from a gallows."
  },
  "45": {
    "roll": "45",
    "result": "A rabid dog jumps from a nearby alleyway, attempting to bite a random player."
  },
  "46": {
    "roll": "46",
    "result": "A fire breaks out inside a nearby building. A bucket brigade forms as people try to put it out."
  },
  "47": {
    "roll": "47",
    "result": "A town crier announces the opening of a new tavern."
  },
  "48": {
    "roll": "48",
    "result": "A man happily carries a fishing rod as he strolls past the players."
  },
  "49": {
    "roll": "49",
    "result": "A champion gladiator walks through the streets as people cheer."
  },
  "50": {
    "roll": "50",
    "result": "A hunchbacked man plays a violin beautifully on a street corner."
  },
  "51": {
    "roll": "51",
    "result": "A mysterious obelisk appears in the town center overnight."
  },
  "52": {
    "roll": "52",
    "result": "A half-eaten body is discovered outside of town."
  },
  "53": {
    "roll": "53",
    "result": "An elf walks the streets with a look of disgust on her face."
  },
  "54": {
    "roll": "54",
    "result": "A merchant approaches the players and tries to buy a trinket they possess."
  },
  "55": {
    "roll": "55",
    "result": "A funeral procession walks mournfully through the town."
  },
  "56": {
    "roll": "56",
    "result": "A strange woman asks to interpret the player's dreams for them."
  },
  "57": {
    "roll": "57",
    "result": "A group of children play dice on a street corner."
  },
  "58": {
    "roll": "58",
    "result": "Members of a local guild are looking for new recruits."
  },
  "59": {
    "roll": "59",
    "result": "A blacksmith hammers a freshly forged blade nearby."
  },
  "60": {
    "roll": "60",
    "result": "Mysterious chanting can be heard coming from an abandoned house at night."
  },
  "61": {
    "roll": "61",
    "result": "A diseased begger begs the players for a cure for their sickness."
  },
  "62": {
    "roll": "62",
    "result": "A farmer and his two sons ride past the party with a cart full of fresh vegetables."
  },
  "63": {
    "roll": "63",
    "result": "A gnome is performing magic tricks on a street corner for tips with their ogre assistant."
  },
  "64": {
    "roll": "64",
    "result": "A caged animal has escaped capture and is running through the streets."
  },
  "65": {
    "roll": "65",
    "result": "A tavern brawl spills out onto the street, in front of the players."
  },
  "66": {
    "roll": "66",
    "result": "A local ruffian is writing crude graffiti on the side of a building."
  },
  "67": {
    "roll": "67",
    "result": "An old woman is tending her garden outside of her home."
  },
  "68": {
    "roll": "68",
    "result": "A small child asks the players for help finding her pet frog."
  },
  "69": {
    "roll": "69",
    "result": "The wind kicks up and a strong gust blows a trader's tent over. Their merchandice spills into the street."
  },
  "70": {
    "roll": "70",
    "result": "A cunning thief 'accidently' bumps into a random player, taking their coin purse."
  },
  "71": {
    "roll": "71",
    "result": "A random player finds what looks to be a wedding ring sticking out of the dirt in front of them."
  },
  "72": {
    "roll": "72",
    "result": "An injured man is being escourted to a local doctor by his brother."
  },
  "73": {
    "roll": "73",
    "result": "A group of guards block off the beginning of a street, and they won't let anyone pass."
  },
  "74": {
    "roll": "74",
    "result": "A noble mistakenly 'recognizes' a random player from a dance a few nights ago."
  },
  "75": {
    "roll": "75",
    "result": "A group of teenagers are preparing to launch fireworks."
  },
  "76": {
    "roll": "76",
    "result": "A local apothocary questions the players about their herb knowledge."
  },
  "77": {
    "roll": "77",
    "result": "An old wizard walks down the street with two clockwork servants."
  },
  "78": {
    "roll": "78",
    "result": "A nearby shop is having a 50% off sale and the line to get in wraps around the building."
  },
  "79": {
    "roll": "79",
    "result": "Two dwarves are arguing in Dwarvish in the middle of the street."
  },
  "80": {
    "roll": "80",
    "result": "A few stray dogs are fighting over something in a nearby alleyway."
  },
  "81": {
    "roll": "81",
    "result": "A baker chases rats out of her shop with a rolling pin. She asks the players for help."
  },
  "82": {
    "roll": "82",
    "result": "A diseased man is seen coughing on random people in the street."
  },
  "83": {
    "roll": "83",
    "result": "A priest asks the players if he can bless them before their next adventure."
  },
  "84": {
    "roll": "84",
    "result": "A high-class carriage rolls by the players and a beautiful elven woman inside waves to them."
  },
  "85": {
    "roll": "85",
    "result": "A group of fisherman are yelling about something strange that was caught this morning."
  },
  "86": {
    "roll": "86",
    "result": "A guard is pinning a Wanted poster to a city message board."
  },
  "87": {
    "roll": "87",
    "result": "A large man dressed in silks carries two pies in each hand."
  },
  "88": {
    "roll": "88",
    "result": "A busker in the street plays one song on his lute repeatedly."
  },
  "89": {
    "roll": "89",
    "result": "A woman is chasing a large cheese wheel rolling away from her down that street."
  },
  "90": {
    "roll": "90",
    "result": "A toothless old man offers the players an unlabled potion for free."
  },
  "91": {
    "roll": "91",
    "result": "A frazzled traveler is studying a large map."
  },
  "92": {
    "roll": "92",
    "result": "A large flock of birds swoops past the party onto a building nearby."
  },
  "93": {
    "roll": "93",
    "result": "A man is arguing with a tax-collector and two armed guards."
  },
  "94": {
    "roll": "94",
    "result": "A group of halfllings have set up a market stall selling massive vegetables."
  },
  "95": {
    "roll": "95",
    "result": "The players overhear two men talking about what they know of the Feywild."
  },
  "96": {
    "roll": "96",
    "result": "A group of nomads are traveling through town, looking for a place to sleep for the night."
  },
  "97": {
    "roll": "97",
    "result": "A wizard is frantically looking everywhere for his missing wand."
  },
  "98": {
    "roll": "98",
    "result": "An ogre is spotted outside the settlement stealing a horse."
  },
  "99": {
    "roll": "99",
    "result": "A talkative bard asks the players for inspiration for a new song. The song becomes a smash hit."
  },
  "100": {
    "roll": "100",
    "result": "The ruler of the settlement travels through the street with a group of armed guards."
  }
}